; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }

@counter = global %struct.bpf_map_def { i32 2, i32 4, i32 4, i32 10, i32 0, i32 0, i32 0 }, section "maps", align 4, !dbg !0
@tx_port = global %struct.bpf_map_def { i32 14, i32 4, i32 4, i32 10, i32 0, i32 0, i32 0 }, section "maps", align 4, !dbg !9
@xdp_pass_func.____fmt = private unnamed_addr constant [5 x i8] c"\09%d\0A\00", align 1
@_license = global [4 x i8] c"GPL\00", section "license", align 1, !dbg !22
@llvm.used = appending global [4 x i8*] [i8* getelementptr inbounds ([4 x i8], [4 x i8]* @_license, i32 0, i32 0), i8* bitcast (%struct.bpf_map_def* @counter to i8*), i8* bitcast (%struct.bpf_map_def* @tx_port to i8*), i8* bitcast (i32 (%struct.xdp_md*)* @xdp_pass_func to i8*)], section "llvm.metadata"

; Function Attrs: nounwind
define i32 @xdp_pass_func(%struct.xdp_md* nocapture readonly) #0 section "xdp_pass" !dbg !50 {
  %2 = alloca i32, align 4
  %3 = alloca [5 x i8], align 1
  call void @llvm.dbg.value(metadata %struct.xdp_md* %0, metadata !65, metadata !DIExpression()), !dbg !104
  %4 = getelementptr inbounds %struct.xdp_md, %struct.xdp_md* %0, i64 0, i32 0, !dbg !105
  %5 = load i32, i32* %4, align 4, !dbg !105, !tbaa !106

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "counter", scope: !2, file: !3, line: 16, type: !11, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !8)
!3 = !DIFile(filename: "xdp_prog_kern.c", directory: "/home/anuraag/mtp/proc_more/reverse/ingress-3-egress")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!8 = !{!0, !9, !22, !28, !36, !41}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "tx_port", scope: !2, file: !3, line: 24, type: !11, isLocal: false, isDefinition: true)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !12, line: 210, size: 224, elements: !13)
!12 = !DIFile(filename: "../includes/headers/bpf_helpers.h", directory: "/home/anuraag/mtp/proc_more/reverse/ingress-3-egress")
!13 = !{!14, !16, !17, !18, !19, !20, !21}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !11, file: !12, line: 211, baseType: !15, size: 32)
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !11, file: !12, line: 212, baseType: !15, size: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !11, file: !12, line: 213, baseType: !15, size: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !11, file: !12, line: 214, baseType: !15, size: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !11, file: !12, line: 215, baseType: !15, size: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_idx", scope: !11, file: !12, line: 216, baseType: !15, size: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !11, file: !12, line: 217, baseType: !15, size: 32, offset: 192)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 78, type: !24, isLocal: false, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 32, elements: !26)
!25 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!26 = !{!27}
!27 = !DISubrange(count: 4)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !12, line: 38, type: !30, isLocal: true, isDefinition: true)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DISubroutineType(types: !32)
!32 = !{!33, !34, !33, null}
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !12, line: 20, type: !38, isLocal: true, isDefinition: true)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!6, !6, !6}
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "bpf_redirect_map", scope: !2, file: !12, line: 57, type: !43, isLocal: true, isDefinition: true)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!33, !6, !33, !33}
!46 = !{i32 2, !"Dwarf Version", i32 4}
!47 = !{i32 2, !"Debug Info Version", i32 3}
!48 = !{i32 1, !"wchar_size", i32 4}
!49 = !{!"clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)"}
!50 = distinct !DISubprogram(name: "xdp_pass_func", scope: !3, file: !3, line: 32, type: !51, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !64)
!51 = !DISubroutineType(types: !52)
!52 = !{!33, !53}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !55, line: 2856, size: 160, elements: !56)
!55 = !DIFile(filename: "../includes/headers/linux/bpf.h", directory: "/home/anuraag/mtp/proc_more/reverse/ingress-3-egress")
!56 = !{!57, !60, !61, !62, !63}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !54, file: !55, line: 2857, baseType: !58, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !59, line: 27, baseType: !15)
!59 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/anuraag/mtp/proc_more/reverse/ingress-3-egress")
!60 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !54, file: !55, line: 2858, baseType: !58, size: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !54, file: !55, line: 2859, baseType: !58, size: 32, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !54, file: !55, line: 2861, baseType: !58, size: 32, offset: 96)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !54, file: !55, line: 2862, baseType: !58, size: 32, offset: 128)
!64 = !{!65, !66, !67, !68, !84, !87, !88, !90, !92, !95, !100, !103}
!65 = !DILocalVariable(name: "ctx", arg: 1, scope: !50, file: !3, line: 32, type: !53)
!66 = !DILocalVariable(name: "data", scope: !50, file: !3, line: 34, type: !6)
!67 = !DILocalVariable(name: "data_end", scope: !50, file: !3, line: 35, type: !6)
!68 = !DILocalVariable(name: "eth", scope: !50, file: !3, line: 36, type: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !71, line: 159, size: 112, elements: !72)
!71 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "/home/anuraag/mtp/proc_more/reverse/ingress-3-egress")
!72 = !{!73, !78, !79}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !70, file: !71, line: 160, baseType: !74, size: 48)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 48, elements: !76)
!75 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!76 = !{!77}
!77 = !DISubrange(count: 6)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !70, file: !71, line: 161, baseType: !74, size: 48, offset: 48)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !70, file: !71, line: 162, baseType: !80, size: 16, offset: 96)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !81, line: 25, baseType: !82)
!81 = !DIFile(filename: "/usr/include/linux/types.h", directory: "/home/anuraag/mtp/proc_more/reverse/ingress-3-egress")
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !59, line: 24, baseType: !83)
!83 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!84 = !DILocalVariable(name: "offset", scope: !50, file: !3, line: 37, type: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !59, line: 31, baseType: !86)
!86 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!87 = !DILocalVariable(name: "key", scope: !50, file: !3, line: 42, type: !33)
!88 = !DILocalVariable(name: "val", scope: !50, file: !3, line: 43, type: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!90 = !DILocalVariable(name: "temp", scope: !91, file: !3, line: 45, type: !33)
!91 = distinct !DILexicalBlock(scope: !50, file: !3, line: 45, column: 5)
!92 = !DILocalVariable(name: "waste", scope: !93, file: !3, line: 46, type: !33)
!93 = distinct !DILexicalBlock(scope: !94, file: !3, line: 45, column: 38)
!94 = distinct !DILexicalBlock(scope: !91, file: !3, line: 45, column: 5)
!95 = !DILocalVariable(name: "____fmt", scope: !96, file: !3, line: 51, type: !97)
!96 = distinct !DILexicalBlock(scope: !93, file: !3, line: 51, column: 3)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 40, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 5)
!100 = !DILocalVariable(name: "dst", scope: !50, file: !3, line: 64, type: !101)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 48, elements: !76)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !59, line: 21, baseType: !75)
!103 = !DILocalVariable(name: "src", scope: !50, file: !3, line: 64, type: !101)
!104 = !DILocation(line: 32, column: 35, scope: !50)
!105 = !DILocation(line: 34, column: 34, scope: !50)
!106 = !{!107, !108, i64 0}
!107 = !{!"xdp_md", !108, i64 0, !108, i64 4, !108, i64 8, !108, i64 12, !108, i64 16}
!108 = !{!"int", !109, i64 0}
!109 = !{!"omnipotent char", !110, i64 0}
!110 = !{!"Simple C/C++ TBAA"}
!111 = !DILocation(line: 34, column: 23, scope: !50)
!112 = !DILocation(line: 34, column: 15, scope: !50)
!113 = !DILocation(line: 34, column: 8, scope: !50)
!114 = !DILocation(line: 35, column: 38, scope: !50)
!115 = !{!107, !108, i64 4}
!116 = !DILocation(line: 35, column: 27, scope: !50)
!117 = !DILocation(line: 35, column: 19, scope: !50)
!118 = !DILocation(line: 35, column: 8, scope: !50)
!119 = !DILocation(line: 36, column: 23, scope: !50)
!120 = !DILocation(line: 36, column: 17, scope: !50)
!121 = !DILocation(line: 37, column: 8, scope: !50)
!122 = !DILocation(line: 39, column: 18, scope: !123)
!123 = distinct !DILexicalBlock(scope: !50, file: !3, line: 39, column: 6)
!124 = !DILocation(line: 39, column: 27, scope: !123)
!125 = !DILocation(line: 39, column: 6, scope: !50)
!126 = !DILocation(line: 42, column: 5, scope: !50)
!127 = !DILocation(line: 42, column: 9, scope: !50)
!128 = !{!108, !108, i64 0}
!129 = !DILocation(line: 45, column: 13, scope: !91)
!130 = !DILocation(line: 46, column: 7, scope: !93)
!131 = !DILocation(line: 51, column: 3, scope: !96)
!132 = !DILocation(line: 51, column: 3, scope: !93)
!133 = !DILocation(line: 52, column: 9, scope: !93)
!134 = !DILocation(line: 54, column: 10, scope: !50)
!135 = !DILocation(line: 43, column: 10, scope: !50)
!136 = !DILocation(line: 55, column: 8, scope: !137)
!137 = distinct !DILexicalBlock(scope: !50, file: !3, line: 55, column: 8)
!138 = !DILocation(line: 55, column: 8, scope: !50)
!139 = !DILocation(line: 56, column: 15, scope: !140)
!140 = distinct !DILexicalBlock(scope: !137, file: !3, line: 55, column: 12)
!141 = !DILocation(line: 57, column: 5, scope: !140)
